{
    "cookies": {
        "title": "سياسة الكوكيز",
        "subtitle": "آخر تحديث: 12 فبراير 2026",
        "intro": "توضح هذه الصفحة الكوكيز التي نستخدمها، ولماذا نستخدمها، وكيف يمكنك إدارتها. نظرًا لأن هذا مشروع صغير لشخص واحد، فإن استخدامنا للكوكيز محدود وشفاف.",
        "section1": {
            "title": "1. ما هي الكوكيز؟",
            "p1": "الكوكيز هي ملفات نصية صغيرة تخزنها المواقع على جهازك (كمبيوتر، هاتف، أو جهاز لوحي) عند زيارتك لها. تساعد الكوكيز الموقع على تذكر معلومات حول زيارتك مثل تفضيل اللغة، حالة تسجيل الدخول، أو التحليلات لتجربة أفضل في المرة القادمة.",
            "p2": "نستخدم فقط الكوكيز الضرورية والوظيفية بشكل محدود — لا تتبع إعلاني ثقيل أو ملفات تعريف شخصية من طرف ثالث."
        },
        "section2": {
            "title": "2. الكوكيز التي نستخدمها",
            "essential": "الكوكيز الأساسية / الضرورية",
            "alwaysOn": "مفعلة دائمًا",
            "essentialDesc": "هذه مطلوبة لكي يعمل الموقع بشكل صحيح. لا يمكنك تعطيلها.",
            "functional": "الكوكيز الوظيفية",
            "optional": "اختياري",
            "functionalDesc": "تحسن هذه الكوكيز تجربتك لكنها ليست ضرورية للوظائف الأساسية.",
            "analytics": "الكوكيز التحليلية و الطرف الثالث",
            "analyticsDesc": "حاليًا: لا توجد. نحن لا نستخدم Google Analytics، Meta Pixel، Hotjar، Mixpanel أو أي خدمة تتبع خارجية. إذا أضفنا التحليلات مستقبلًا، سنحدّث هذه الصفحة ونطلب موافقتك أولًا."
        },
        "section3": {
            "title": "3. كيفية إدارة أو حذف الكوكيز",
            "p1": "يمكنك التحكم في الكوكيز من خلال إعدادات المتصفح. معظم المتصفحات تتيح لك:",
            "li1": "رؤية الكوكيز المخزنة وحذفها",
            "li2": "حظر الكوكيز من مواقع معينة",
            "li3": "حظر كوكيز الطرف الثالث",
            "li4": "إيقاف الكوكيز تمامًا (قد يؤثر على تسجيل الدخول/الجلسة)",
            "p2": "نظرًا لأننا نستخدم فقط الكوكيز الأساسية والوظيفية المحدودة، فإن حظرها قد يجعل تسجيل الدخول، اختيار اللغة، أو حفظ الثيم يتوقف عن العمل بشكل صحيح."
        },
        "section4": {
            "title": "أسئلة حول الكوكيز؟",
            "p1": "إذا كان هناك أي شيء غير واضح، أو لديك مخاوف حول كيفية استخدامنا للكوكيز، فقط تواصل معي — أقرأ كل رسالة شخصيًا."
        },
        "contact": {
            "email": "أرسل لي بريدًا",
            "page": "اذهب إلى صفحة الاتصال"
        },
        "footer": "نحافظ على هذه السياسة قصيرة وواضحة لأنها لا تزال مشروعًا صغيرًا جدًا. قد تصبح أكثر تفصيلًا عند إضافة ميزات أو خدمات طرف ثالث في المستقبل.",
        "footer.ps": "شكرًا للقراءة — ولثقتك في بياناتك معنا."
    }
}