{
    "security": {
        "title": "الأمان وحماية البيانات",
        "subtitle": "الأمان ليس مجرد فكرة لاحقة — حتى مع أن هذا المشروع لا يزال صغيرًا ويعمل عليه شخص واحد فقط. إليك ما أفعله اليوم للحفاظ على بياناتك آمنة بشكل معقول.",
        "posture": {
            "title": "ممارسات الأمان الحالية (2026)",
            "auth": "المصادقة",
            "authDesc": "Supabase Auth (البريد + كلمة المرور، رموز آمنة، تدوير التحديث، تحديد معدل المحاولات). لا توجد تسجيلات دخول اجتماعية بعد.",
            "rls": "أمان مستوى الصف (RLS)",
            "rlsDesc": "كل جدول يستخدم RLS. يمكن للمستخدمين رؤية وتعديل البيانات الخاصة بشركتهم فقط.",
            "encryption": "التشفير",
            "encryptionDesc": "البيانات أثناء النقل: TLS 1.3 في كل مكان. البيانات المخزنة: مشفرة بواسطة Supabase (PostgreSQL). الحقول الحساسة (إن وجدت) مشفرة من جانب العميل عند الإمكان.",
            "storage": "تخزين الملفات",
            "storageDesc": "Supabase Storage بروابط موقعة، تجنب الدلاء العامة، قيود على نوع وحجم الملفات.",
            "monitoring": "المراقبة والتنبيهات",
            "monitoringDesc": "محاولات تسجيل الدخول، فشل المصادقة، الأنشطة المشبوهة مسجلة. تنبيهات أساسية عبر البريد للأحداث الحرجة.",
            "limit": {
                "title": "القيود الحالية",
                "desc": "لا يوجد SOC 2 رسمي بعد، لا برنامج مكافآت الأخطاء، لا اختبارات اختراق خارجية (بعد)، مطور واحد فقط — لذا خطأ بشري هو أكبر مخاطرة الآن."
            }
        },
        "roadmap": {
            "title": "خطة الأمان المستقبلية",
            "subtitle": "مع نمو المنتج وجلب الإيرادات، أخطط للاستثمار بجدية أكبر في الأمان.",
            "short": "قصير المدى",
            "short1": "تمكين 2FA / كلمات المرور بدون كلمة (مدعومة بالفعل من Supabase)",
            "short1desc": "سيتم تطبيقها أولًا على الأدوار الإدارية، ثم اختيارية للجميع.",
            "medium": "متوسط المدى",
            "medium1": "تدقيق أمني خارجي / اختبار اختراق",
            "medium1desc": "بمجرد أن نحصل على عملاء ودخل ملموس.",
            "long": "طويل المدى",
            "long1": "برنامج مكافآت الأخطاء",
            "long1desc": "دعوة القراصنة الأخلاقيين لاكتشاف المشاكل مع مكافآت.",
            "long2": "SOC 2 / ISO 27001",
            "long2desc": "فقط عند وجود اهتمام وميزانية من الشركات الكبرى."
        },
        "report": {
            "title": "وجدت ثغرة أمنية؟",
            "desc": "إذا اكتشفت أي ثغرة أمنية — حتى لو كانت صغيرة — يرجى الإبلاغ عنها بمسؤولية. أنا أتعامل مع كل تقرير بجدية.",
            "email": "أرسل تقرير أمني عبر البريد",
            "twitter": "راسلني سرًا على X",
            "note": "يرجى عدم نشر الثغرات علنًا حتى أحصل على وقت معقول لإصلاحها. شكرًا لمساعدتك في الحفاظ على الأمان."
        },
        "footer": "تم تصميم هذه الصفحة ببساطة لأن المنتج لا يزال في مراحله المبكرة. سيصبح الأمان أكثر رسمية مع نمو المنتج وجذب العملاء.",
        "footer.ps": "شكرًا لك على الاهتمام بالأمان — فهذا يهمني أيضًا."
    }
}