{
    "security": {
        "title": "الأمان وحماية البيانات",
        "subtitle": "الأمان مهم — رغم أن هذا المشروع لا يزال صغيرًا جدًا ويُدار بواسطة شخص واحد في القاهرة. إليك ما أفعله حاليًا لحماية بياناتك بشكل معقول وما أخطط لتحسينه مع نمو المشروع.",
        "measures": {
            "title": "ممارسات الأمان الحالية (فبراير 2026)",
            "auth": "المصادقة",
            "authDesc": "Supabase Auth مع تشفير كلمات المرور الآمن، تحديد محاولات تسجيل الدخول، تدوير رموز التحديث، وإلغاء الجلسات عند تغيير كلمة المرور.",
            "rls": "أمان مستوى الصف (RLS)",
            "rlsDesc": "كل جدول يطبق سياسات RLS. يمكن للمستخدمين قراءة/كتابة البيانات الخاصة بشركتهم فقط — يتم تطبيقها على مستوى قاعدة البيانات.",
            "tls": "التشفير أثناء النقل",
            "tlsDesc": "كل حركة المرور تستخدم TLS 1.3 (المتصفحات الحديثة تفرض ذلك). Supabase edge + CDN أيضًا تفرض HTTPS.",
            "storage": "أمان تخزين الملفات",
            "storageDesc": "Supabase Storage مع دلاء خاصة بشكل افتراضي، روابط مؤقتة موقعة للتنزيلات، قيود على حجم ونوع الملفات، لا توجد روابط عامة.",
            "logging": "تسجيل الدخول والنشاط",
            "loggingDesc": "سجل مراجعة أساسي للإجراءات المهمة (تسجيل الدخول، تغيير كلمة المرور، تغييرات الدور، تحميل الملفات). يتم تخزين السجلات بأمان والاحتفاظ بها لأغراض الإصلاح.",
            "limits": {
                "title": "القيود الحالية",
                "desc": "لا توجد شهادات SOC 2 / ISO 27001 رسمية بعد، لا اختبارات اختراق خارجية، لا برنامج مكافأة الثغرات، مطور واحد — يظل الخطأ البشري أكبر خطر في هذه المرحلة."
            }
        },
        "roadmap": {
            "title": "خطة الأمان المستقبلية",
            "subtitle": "ما أخطط لتحسينه مع نمو المنتج وتحقيق الإيرادات.",
            "short": "قصيرة المدى (1–3 أشهر القادمة)",
            "2fa": "تمكين المصادقة الثنائية / كلمات المرور المميزة",
            "2faDesc": "مدعومة بالفعل من Supabase — ستكون إلزامية أولًا لأدوار المسؤول/المدير.",
            "medium": "متوسطة المدى (3–12 شهرًا)",
            "audit": "تدقيق أمني خارجي / اختبار اختراق",
            "auditDesc": "بمجرد أن يكون لدينا عملاء يدفعون واستخدام فعلي.",
            "monitoring": "مراقبة وتنبيهات أفضل",
            "monitoringDesc": "محاولات تسجيل دخول فاشلة، أنماط IP مشبوهة، تحميل ملفات كبيرة، أنماط استعلام غير عادية.",
            "long": "بعيدة المدى / عند جاهزية المؤسسة",
            "bounty": "برنامج مكافأة الثغرات العامة",
            "bountyDesc": "مكافأة المخترقين الأخلاقيين على اكتشاف الثغرات الحقيقية.",
            "compliance": "SOC 2 النوع 1 / النوع 2",
            "complianceDesc": "فقط عند وجود اهتمام من الشركات وميزانية لتغطية التكلفة."
        },
        "report": {
            "title": "هل وجدت مشكلة أمان محتملة؟",
            "desc": "إذا اكتشفت أي ثغرة — حتى لو كانت صغيرة — يرجى الإبلاغ عنها بمسؤولية. أنا أتعامل مع كل تقرير بجدية وسأرد بسرعة.",
            "email": "إرسال تقرير أمني عبر البريد",
            "twitter": "راسلني خاص على X",
            "note": "يرجى عدم نشر الثغرات علنًا حتى أحصل على وقت معقول لإصلاحها. شكرًا لمساعدتك في الحفاظ على الأمان."
        },
        "footer": "تم تصميم هذه الصفحة ببساطة لأن المنتج لا يزال في مرحلة مبكرة جدًا. ستصبح ممارسات الأمان أكثر رسمية (ووثائقية) مع نمو المشروع واستقطاب العملاء.",
        "footer.ps": "شكرًا لاهتمامك بالأمان — إنه مهم بالنسبة لي أيضًا."
    }
}