{
    "terms": {
        "title": "شروط الخدمة",
        "subtitle": "آخر تحديث: 12 فبراير 2026",
        "intro": "هذه هي الشروط التي تسمح لك باستخدام هذه الخدمة. نظرًا لأن هذا منتج صغير في مراحله المبكرة ويعمل عليه شخص واحد فقط، فهي قصيرة عمدًا ومكتوبة بلغة بسيطة.",
        "section1": {
            "title": "1. قبول الشروط",
            "p1": "بالوصول إلى هذا الموقع أو استخدام هذه الخدمة (\"الخدمة\"), فإنك توافق على الالتزام بهذه الشروط. إذا لم توافق على أي جزء من هذه الشروط، فلا يجوز لك استخدام الخدمة.",
            "p2": "قد نقوم بتحديث هذه الشروط من وقت لآخر. سنخطرك بالتغييرات الجوهرية (عبر البريد الإلكتروني أو إشعار داخل التطبيق). استمرار استخدامك بعد التغييرات يشكل قبولًا للشروط الجديدة."
        },
        "section2": {
            "title": "2. وصف الخدمة",
            "p1": "هذه أداة لإدارة الموارد البشرية / القوى العاملة في مرحلة مبكرة، تم بناؤها وصيانتها بواسطة شخص واحد. تتضمن ميزات مثل ملفات الموظفين، سجلات العمل، الأهداف، التقييمات الأساسية، الإشعارات، والمزيد — وكلها لا تزال قيد التطوير.",
            "p2": "تُقدم الخدمة كما هي ومتاحة كما هي. قد تتغير الميزات أو تُزال أو تتعطل أحيانًا — خاصة في هذه المرحلة المبكرة."
        },
        "section3": {
            "title": "3. الحسابات والأمان",
            "p1": "أنت مسؤول عن الحفاظ على سرية بيانات حسابك وعن جميع الأنشطة التي تحدث ضمن حسابك.",
            "p2": "يجب إخطارنا فورًا بأي استخدام غير مصرح به أو خرق أمني. نحن غير مسؤولين عن أي خسارة أو ضرر ينشأ عن عدم تأمين حسابك."
        },
        "section4": {
            "title": "4. الاستخدام المقبول",
            "p1": "أنت توافق على عدم:",
            "li1": "استخدام الخدمة لأي غرض غير قانوني",
            "li2": "محاولة الوصول غير المصرح به لأي جزء من الخدمة",
            "li3": "التدخل أو تعطيل الخدمة أو الخوادم / الشبكات",
            "li4": "تحميل فيروسات أو برامج ضارة أو كود ضار",
            "li5": "مضايقة أو إساءة أو الإضرار بالمستخدمين الآخرين",
            "li6": "جمع البيانات بشكل منهجي بدون إذن"
        },
        "section5": {
            "title": "5. بياناتك والخصوصية",
            "p1": "تحتفظ بملكية أي بيانات تقوم بتحميلها أو إدخالها في الخدمة (“بياناتك”). باستخدام الخدمة، تمنحنا ترخيصًا محدودًا لتخزين ومعالجة وعرض بياناتك فقط لتقديم الخدمة وتحسينها.",
            "p2": "نقوم باتخاذ تدابير معقولة لحماية بياناتك، لكن لا يمكننا ضمان الأمان المطلق. يرجى عدم تحميل معلومات شخصية حساسة إلا عند الضرورة.",
            "p3": "راجع سياسة الخصوصية المنفصلة الخاصة بنا لمزيد من التفاصيل حول كيفية تعاملنا مع البيانات."
        },
        "section6": {
            "title": "6. تحديد المسؤولية",
            "p1": "تُقدم الخدمة كما هي دون أي ضمانات من أي نوع. نحن غير مسؤولين عن أي أضرار غير مباشرة أو عرضية أو خاصة أو تبعية أو عقابية تنشأ عن استخدامك للخدمة — حتى لو تم إعلامنا بالإمكانية.",
            "p2": "نظرًا لأن هذا منتج صغير في مراحله المبكرة ويعمل عليه شخص واحد، فقد تحدث توقفات، أخطاء، فقدان بيانات، أو ميزات مفقودة. استخدم على مسؤوليتك الخاصة."
        },
        "section7": {
            "title": "7. إنهاء الخدمة",
            "p1": "قد نقوم بتعليق أو إنهاء وصولك إلى الخدمة في أي وقت، سواء مع أو بدون سبب أو إشعار، خاصة إذا اعتقدنا أنك انتهكت هذه الشروط.",
            "p2": "يمكنك التوقف عن استخدام الخدمة في أي وقت. عند الإنهاء، تنتهي حقوقك في استخدام الخدمة فورًا."
        },
        "section8": {
            "title": "8. القانون الحاكم والتواصل",
            "p1": "تخضع هذه الشروط لقوانين جمهورية مصر العربية، دون النظر إلى تعارض القوانين.",
            "p2": "إذا كانت لديك أي أسئلة حول هذه الشروط، يرجى الاتصال بي مباشرة:"
        },
        "contact": {
            "email": "أرسل لي بريدًا",
            "page": "اذهب إلى صفحة الاتصال"
        },
        "footer": "تم تصميم هذه الشروط لتكون قصيرة وقابلة للقراءة لأنها مشروع صغير في مراحله المبكرة. قد تتطور مع نمو المنتج.",
        "footer.ps": "شكرًا للقراءة — وللاستخدامك الخدمة."
    }
}